morze_dict = {'А': '.-', 'Б': '-...', 'В': '.--',
              'Г': '--.', 'Д': '-..', 'Е': '.',
              'Ё': '.', 'Ж': '...-', 'З': '--..',
              'И': '..', 'Й': '.---', 'К': '-.-',
              'Л': '.-..', 'М': '--', 'Н': '-.',
              'О': '---', 'П': '.--.', 'Р': '.-.',
              'С': '...', 'Т': '-', 'У': '..-',
              'Ф': '..-.', 'Х': '....', 'Ц': '-.-.',
              'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
              'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-',
              'Э': '..-..', 'Ю': '..--', 'Я': '.-.-',
              ' ': '-...-'}

decod = {
    '-...-': ' ', '.': 'е', '.-': 'а', '-...': 'б', '.--': 'в', '--.': 'г',
    '-..': 'д', '...-': 'ж', '--..': 'з', '..': 'и', '.---': 'й', '-.-': 'к',
    '.-..': 'л', '--': 'м', '-.': 'н', '---': 'о', '.--.': 'п', '.-.': 'р',
    '...': 'с', '-': 'т', '..-': 'у', '..-.': 'ф', '....': 'х', '-.-.': 'ц',
    '---.': 'ч', '----': 'ш', '--.-': 'щ', '--.--': 'ъ', '-.--': 'ы',
    '-..-': 'ь', '..-..': 'э', '..--': 'ю', '.-.-': 'я'
}

def morze_word(text):
    result = ''
    for i in text.upper():
        if i in morze_dict:
            result += morze_dict[i] + ' '
    return result.strip() #удаляет лишний пробел в конце

def morze_code(symbol):
    result = ''
    codes = symbol.split()           # разбиваем строку на отдельные коды Морзе
    for j in codes:
        if j in decod:               # ищем код Морзе напрямую в decod (ключи — коды)
            result += decod[j]      # добавляем соответствующую букву
    return result.lower().strip()

# d = dict(zip(morze.values(), morze.keys())) обратный словарь автоматически, а не вручную

def test_morze_word():
    assert morze_word('Я') == '.-.-'
    assert morze_word('Москва') == '-- --- ... -.- .-- .-'
    assert morze_word('Я люблю Питон') == '.-.- -...- .-.. ..-- -... .-.. ..-- -...- .--. .. - --- -.'
    assert morze_word('Сергей Балакирев') == '... . .-. --. . .--- -...- -... .- .-.. .- -.- .. .-. . .--'

def test_morze_code():
    assert morze_code('.-- ... . -...- .-- . .-. -. ---') == 'все верно'



