def morze_word(text):
    morze_dict = {'А': '.-', 'Б': '-...', 'В': '.--',
              'Г': '--.', 'Д': '-..', 'Е': '.',
              'Ё': '.', 'Ж': '...-', 'З': '--..',
              'И': '..', 'Й': '.---', 'К': '-.-',
              'Л': '.-..', 'М': '--', 'Н': '-.',
              'О': '---', 'П': '.--.', 'Р': '.-.',
              'С': '...', 'Т': '-', 'У': '..-',
              'Ф': '..-.', 'Х': '....', 'Ц': '-.-.',
              'Ч': '---.', 'Ш': '----', 'Щ': '--.-',
              'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-',
              'Э': '..-..', 'Ю': '..--', 'Я': '.-.-',
              ' ': '-...-'}
    result = ''
    for i in text.upper():
        if i in morze_dict:
            result += morze_dict[i] + ' '
    return result.strip() #удаляет лишний пробел в конце

def test_morze_word():
    assert morze_word('Я') == '.-.-'
    assert morze_word('Москва') == '-- --- ... -.- .-- .-'
    assert morze_word('Я люблю Питон') == '.-.- -...- .-.. ..-- -... .-.. ..-- -...- .--. .. - --- -.'
    assert morze_word('Сергей Балакирев') == '... . .-. --. . .--- -...- -... .- .-.. .- -.- .. .-. . .--'





